<template>
	<v-container id="dropdown-example" >
		<v-layout row wrap>
			<v-flex xs12 sm4>

				<v-layout row>

					<v-img class="character-image" :src="characterImage" ></v-img>

				</v-layout>
			</v-flex>

			<div class="character-detail">
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
				送到快放假了就饿啦就立刻就发了骄傲了激动覅就是看见对方了看见了就哦IF家暗示的方式对发生的发生的大风非法手段发生的阿斯顿发生的发生的发生的违法手段非法是深色发生的说的发生的发生的
			</div>
		</v-layout>
	</v-container>
</template>

<script>
	export default {
		data() {
			return {
				characterImage: ''
			}
		},
		watch: {

		},
		computed: {

		},
		methods: {

		},
		created() {
			let characterId = this.$bus.activeSideBarIndex;
			this.$bus.$on('activeCharecterChanged', res => {
				console.log(1);
				characterId = this.$bus.activeSideBarIndex
				this.characterImage = '/image/sort/' + characterId + '.jpg';
			})
			this.characterImage = '/image/sort/' + characterId + '.jpg';
		},
		destroyed() {
			this.$bus.$off('activeCharecterChanged')
		}
	}
</script>

<style scoped>

	.character-detail {
		padding: 10px 15px;
		flex: 1;
		background-color: aqua;
	}
</style>
